TexasInstruments/ProcessorSDK/mcu_plus_sdk/examples/industrial_comms/profinet_device_demo/rt_mii/am243x-lp/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM243x_ALX_beta" --package "ALX" --part "ALX" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM243x@08.03.00"
 * @versions {"tool":"1.12.0+2406"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom     = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1    = eeprom.addInstance();
const flash      = scripting.addModule("/board/flash/flash", {}, false);
const flash1     = flash.addInstance();
const led        = scripting.addModule("/board/led/led", {}, false);
const led1       = led.addInstance();
const led2       = led.addInstance();
const led3       = led.addInstance();
const gpio       = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1      = gpio.addInstance();
const gpio2      = gpio.addInstance();
const gpio3      = gpio.addInstance();
const gpio4      = gpio.addInstance();
const i2c        = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1       = i2c.addInstance();
const pruicss    = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1   = pruicss.addInstance();
const uart       = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1      = uart.addInstance();
const profinet   = scripting.addModule("/industrial_comms/profinet/profinet", {}, false);
const profinet1  = profinet.addInstance();
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const mpu_armv75 = mpu_armv7.addInstance();
const timer      = scripting.addModule("/kernel/dpl/timer", {}, false);
const timer1     = timer.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name = "CONFIG_EEPROM0";

flash1.$name                         = "CONFIG_FLASH0";
flash1.name                          = "S25HL512T";
flash1.peripheralDriver.$name        = "CONFIG_OSPI0";
flash1.peripheralDriver.inputClkFreq = 50000000;
flash1.peripheralDriver.OSPI.$assign = "OSPI0";

led1.$name = "CONFIG_CYCLIC_LEDS";
led1.name  = "TPIC2810";

led2.$name = "CONFIG_SYS_FAILURE_LED";

led3.$name = "CONFIG_DCP_SIGNAL_LED";

led2.peripheralDriver      = gpio1;
gpio1.pinDir               = "OUTPUT";
gpio1.$name                = "CONFIG_GPIO1_SYS_FAILURE_LED";
gpio1.GPIO.$assign         = "GPIO1";
gpio1.GPIO.gpioPin.$assign = "ball.A9";

led3.peripheralDriver      = gpio2;
gpio2.$name                = "CONFIG_GPIO0_DCP_SIGNAL_LED";
gpio2.pinDir               = "OUTPUT";
gpio2.GPIO.$assign         = "GPIO0";
gpio2.GPIO.gpioPin.$assign = "ball.U19";

gpio3.pinDir               = "OUTPUT";
gpio3.$name                = "CONFIG_GPIO0_PHY0_RESET";
gpio3.GPIO.$assign         = "GPIO0";
gpio3.GPIO.gpioPin.$assign = "ball.W11";

gpio4.pinDir               = "OUTPUT";
gpio4.$name                = "CONFIG_GPIO0_PHY1_RESET";
gpio4.GPIO.$assign         = "GPIO0";
gpio4.GPIO.gpioPin.$assign = "ball.Y15";

eeprom1.peripheralDriver = i2c1;
led1.peripheralDriver    = i2c1;
i2c1.$name               = "CONFIG_I2C0_CYCLIC_LEDS_EEPROM";
i2c1.I2C.$assign         = "I2C0";

uart1.$name                   = "CONFIG_UART1";
uart1.intrEnable              = "USER_INTR";
uart1.rxTrigLvl               = "1";
uart1.useMcuDomainPeripherals = true;
uart1.MCU_UART.$assign        = "MCU_USART0";

profinet1.$name                              = "CONFIG_PROFINET0";
profinet1.phyAddr0                           = 3;
profinet1.phyAddr1                           = 15;
profinet1.icss_emac[0].$name                 = "CONFIG_ICSS_EMAC0";
profinet1.icss_emac[0].mode                  = scripting.forceWrite("SWITCH");
profinet1.icss_emac[0].phyToMacInterfaceMode = scripting.forceWrite("MII");
profinet1.icss_emac[0].learningEnable        = true;
profinet1.icss_emac[0].linkTaskPriority      = 29;
profinet1.icss_emac[0].rxTaskPriority        = 28;
profinet1.icss_emac[0].txTaskPriority        = 28;
profinet1.ethphy1[0].$name                   = "CONFIG_ETHPHY0";
profinet1.ethphy2[0].$name                   = "CONFIG_ETHPHY1";

profinet1.icss = pruicss1;
pruicss1.$name = "CONFIG_PRU_ICSS1";

debug_log.enableUartLog        = true;
debug_log.uartLog.$name        = "CONFIG_UART_CONSOLE";
debug_log.uartLog.UART.$assign = "USART0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.allowExecute      = false;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.size              = 31;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv72.size              = 15;

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x41010000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv75.$name        = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr     = 0x70000000;
mpu_armv75.size         = 16;
mpu_armv75.allowExecute = false;
mpu_armv75.attributes   = "Cached+Sharable";

timer1.$name         = "CONFIG_TIMER0";
timer1.startTimer    = true;
timer1.timerCallback = "OSAL_FREERTOS_callbackTimer";
timer1.TIMER.$assign = "DMTIMER0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.peripheralDriver.OSPI.CLK.$suggestSolution          = "ball.P20";
flash1.peripheralDriver.OSPI.CSn0.$suggestSolution         = "ball.L20";
flash1.peripheralDriver.OSPI.D3.$suggestSolution           = "ball.N19";
flash1.peripheralDriver.OSPI.D2.$suggestSolution           = "ball.L21";
flash1.peripheralDriver.OSPI.D1.$suggestSolution           = "ball.N20";
flash1.peripheralDriver.OSPI.D0.$suggestSolution           = "ball.L19";
i2c1.I2C.SCL.$suggestSolution                              = "ball.B16";
i2c1.I2C.SDA.$suggestSolution                              = "ball.B15";
uart1.MCU_UART.RXD.$suggestSolution                        = "ball.D6";
uart1.MCU_UART.TXD.$suggestSolution                        = "ball.B2";
profinet1.PRU_ICSSG1_MDIO.$suggestSolution                 = "PRU_ICSSG1_MDIO0";
profinet1.PRU_ICSSG1_MDIO.MDC.$suggestSolution             = "ball.W1";
profinet1.PRU_ICSSG1_MDIO.MDIO.$suggestSolution            = "ball.V2";
profinet1.PRU_ICSSG1_MII_G_RT.$suggestSolution             = "PRU_ICSSG1_MII_G_RT";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXD0.$suggestSolution   = "ball.V4";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXD1.$suggestSolution   = "ball.W5";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXD2.$suggestSolution   = "ball.AA4";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXD3.$suggestSolution   = "ball.Y5";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXDV.$suggestSolution   = "ball.AA5";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_TXD0.$suggestSolution   = "ball.V5";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_TXD1.$suggestSolution   = "ball.W2";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_TXD2.$suggestSolution   = "ball.V6";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_TXD3.$suggestSolution   = "ball.AA7";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_TXEN.$suggestSolution   = "ball.Y7";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXD0.$suggestSolution   = "ball.AA10";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXD1.$suggestSolution   = "ball.Y10";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXD2.$suggestSolution   = "ball.Y11";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXD3.$suggestSolution   = "ball.V12";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXDV.$suggestSolution   = "ball.Y12";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_TXD0.$suggestSolution   = "ball.Y6";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_TXD1.$suggestSolution   = "ball.AA8";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_TXD2.$suggestSolution   = "ball.Y9";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_TXD3.$suggestSolution   = "ball.W9";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_TXEN.$suggestSolution   = "ball.V9";
profinet1.PRU_ICSSG1_MII_G_RT.MII_MR0_CLK.$suggestSolution = "ball.Y2";
profinet1.PRU_ICSSG1_MII_G_RT.MII_MR1_CLK.$suggestSolution = "ball.V10";
profinet1.PRU_ICSSG1_MII_G_RT.MII_MT0_CLK.$suggestSolution = "ball.W6";
profinet1.PRU_ICSSG1_MII_G_RT.MII_MT1_CLK.$suggestSolution = "ball.Y8";
debug_log.uartLog.UART.RXD.$suggestSolution                = "ball.B10";
debug_log.uartLog.UART.TXD.$suggestSolution                = "ball.B11";
